// Реализуйте 3 метода, чтобы в каждом из них получить разные исключения
// Реализуйте метод, принимающий в качестве аргументов два целочисленных массива, и возвращающий новый массив, каждый элемент которого равен разности элементов двух входящих массивов в той же ячейке. Если длины массивов не равны, необходимо как-то оповестить пользователя.
// * Реализуйте метод, принимающий в качестве аргументов два целочисленных массива, и возвращающий новый массив, каждый элемент которого равен частному элементов двух входящих массивов в той же ячейке. Если длины массивов не равны, необходимо как-то оповестить пользователя. Важно: При выполнении метода единственное исключение, которое пользователь может увидеть - RuntimeException, т.е. ваше.

package Lesson1;



public class main {
    public static void main(String[] args) {
        // divide divide = new divide();
        // divide.divide();

        // string string = new string();
        // string.string();

        // arrays arrays = new arrays();
        // arrays.arrays();

        // arrays2 arrays2 = new arrays2();
        // arrays2.arrays();

        rectangle rectangle = new rectangle();
        rectangle.ractangle();

    }

}
    

